#+BLOG: wordpress
#+POSTID: 342
#+DATE: [2016-07-13 Wed 13:18]
#+OPTIONS: toc:nil num:nil todo:nil pri:nil tags:nil ^:nil tex:t
#+CATEGORY: Julia, Computations
#+TAGS:
#+DESCRIPTION:
#+LATEX_HEADER: \usepackage{stmaryrd}

#+TITLE: Savitzky-Golay filters & Julia

# Contains code to tangle
# --> To generate: C-c C-v t

I always have found that presented computations of the [[https://en.wikipedia.org/wiki/Savitzky%25E2%2580%2593Golay_filter][Savitzky-Golay]]
filter coefficients were over tricky. I present here a *simple
formula* and a possible implementation in [[http://julialang.org/][Julia]].

* Symbolic computation to check that it works

We can use [[https://www.wolfram.com/mathematica/][mathematica]] to do a symbolic computation using
$\mathbf{p^\delta} =
\mathbf{D}.\mathbf{R}^{-1}.\mathbf{Q}^t.\mathbf{y}$. 

For a window width of $2n+1=7$ points and a polynomial of degree $d=2$
we get:




#+BEGIN_SRC mathematica :exports code :results latex
n = 3; d = 2;
V = Table[If[j != 0, i^j, 1], {i, -n, n}, {j, 0, d}];
{Qt, R} = QRDecomposition[V];
DD = DiagonalMatrix[Table[Factorial[i], {i, 0, d}]];
DD.Inverse[R].Qt // TeXForm
#+END_SRC

#+RESULTS: sg_mathematica
#+BEGIN_LaTeX
\left(
\begin{array}{ccccccc}
 -\frac{2}{21} & \frac{1}{7} & \frac{2}{7} & \frac{1}{3} & \frac{2}{7} & \frac{1}{7} & -\frac{2}{21} \\
 -\frac{3}{28} & -\frac{1}{14} & -\frac{1}{28} & 0 & \frac{1}{28} & \frac{1}{14} & \frac{3}{28} \\
 \frac{5}{42} & 0 & -\frac{1}{14} & -\frac{2}{21} & -\frac{1}{14} & 0 & \frac{5}{42}
\end{array}
\right)
#+END_LaTeX

\begin{equation}
\left(
\begin{array}{ccccccc}
 -\frac{2}{21} & \frac{1}{7} & \frac{2}{7} & \frac{1}{3} & \frac{2}{7} & \frac{1}{7} & -\frac{2}{21} \\
 -\frac{3}{28} & -\frac{1}{14} & -\frac{1}{28} & 0 & \frac{1}{28} & \frac{1}{14} & \frac{3}{28} \\
 \frac{5}{42} & 0 & -\frac{1}{14} & -\frac{2}{21} & -\frac{1}{14} & 0 & \frac{5}{42}
\end{array}
\right)
\end{equation}

The first row is the smoothing $P(0)$ filter, the second one the
smoothed first order derivative $P'(0)$ filter and the last one the smoothed
second order derivative $P''(0)$ filter.


